ci4_modul10/app/Controllers/Post.php

DELETE FROM `artikel`
WHERE `id` IN ('4')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);