ci4_modul7/app/Controllers/Artikel.php

SELECT *
FROM `kategori`
---

        // Fetch all categories for the filter dropdown
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();