ci4_modul8/app/Controllers/AjaxController.php

SELECT *
FROM `artikel`
---
public function getData()
 {
        $model = new ArtikelModel();
        $data = $model->findAll();

DELETE FROM `artikel`
WHERE `id` IN ('4')
---
    public function delete($id)
    {
        $model = new ArtikelModel();
        $data = $model->delete($id);